## [DataFrame 인덱스 다루기]

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

(2) 데이터 준비 <hr>

In [2]:
# dict 타입의 데이터 생성
exam = {'이름': ['마징가', '배트맨', '홍길동', '임꺽정'],
        '국어': [98, 79, 99, 100],
        '미술': [70, 99, 87, 80],
        '수학': [98, 70, 100, 72],
        '체육': [80, 93, 69, 91]}

(3) 데이터 저장 <hr>

In [3]:
examDF = pd.DataFrame(exam)

In [4]:
examDF

    이름   국어  미술   수학  체육
0  마징가   98  70   98  80
1  배트맨   79  99   70  93
2  홍길동   99  87  100  69
3  임꺽정  100  80   72  91

(5) 새로운 인덱스 설정 - 방법 1 : 인덱스 일부 변경 DF.rename()

In [5]:
# 행 인덱스 일부 변경 => index={기존인덱스: 새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame의 변경 여부 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index={0:'zero'}, inplace=True)

In [6]:
examDF

       이름   국어  미술   수학  체육
zero  마징가   98  70   98  80
1     배트맨   79  99   70  93
2     홍길동   99  87  100  69
3     임꺽정  100  80   72  91

In [7]:
# 열 인덱스 일부 변경 => columns={기존인덱스: 새로운인덱스}
examDF.rename(columns={'체육':'음악'}, inplace=True)

In [8]:
examDF

       이름   국어  미술   수학  음악
zero  마징가   98  70   98  80
1     배트맨   79  99   70  93
2     홍길동   99  87  100  69
3     임꺽정  100  80   72  91

(5) 새로운 인덱스 설정 - 방법 2 : 특정 컬럼 => 인덱스 : DF.set_index()

In [9]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 지정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [13]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라매터가 False로 원본 적용 안됨!
examDF2 = examDF.set_index('이름')
examDF2.index

Index(['마징가', '배트맨', '홍길동', '임꺽정'], dtype='object', name='이름')

In [15]:
# 2개의 컬럼을 행 인덱스 설정 단, inplace 파라매터가 False로 원본에 적용 안됨!
examDF3 = examDF.set_index(['이름', '국어', '수학'])
examDF3.index

MultiIndex([('마징가',  98,  98),
            ('배트맨',  79,  70),
            ('홍길동',  99, 100),
            ('임꺽정', 100,  72)],
           names=['이름', '국어', '수학'])

In [17]:
examDF3.loc[('마징가', 98, 98)]

미술    70
음악    80
Name: (마징가, 98, 98), dtype: int64

In [18]:
examDF3.loc['마징가']

       미술  음악
국어 수학
98 98  70  80

In [19]:
# KeyError => '마징가', 98, 98 형식으로 98로 시작하는 Key 없음
# examDF3.loc[(98, 98)]

(5) 새로운 인덱스 설정 - 방법 3 :

In [21]:
examDF.set_index('이름', inplace=True)

In [22]:
examDF

      국어  미술   수학  음악
이름
마징가   98  70   98  80
배트맨   79  99   70  93
홍길동   99  87  100  69
임꺽정  100  80   72  91

In [28]:
# 현재 행 인덱스 ==> 컬럼으로 추가
examDF.reset_index().reset_index().reset_index()

   level_0  index   이름   국어  미술   수학  음악
0        0      0  마징가   98  70   98  80
1        1      1  배트맨   79  99   70  93
2        2      2  홍길동   99  87  100  69
3        3      3  임꺽정  100  80   72  91

In [32]:
df1 = examDF.reset_index()
df1 = df1. reset_index()
df1

   index   이름   국어  미술   수학  음악
0      0  마징가   98  70   98  80
1      1  배트맨   79  99   70  93
2      2  홍길동   99  87  100  69
3      3  임꺽정  100  80   72  91

In [31]:
df2 = examDF.reset_index(drop=True)
df2

    국어  미술   수학  음악
0   98  70   98  80
1   79  99   70  93
2   99  87  100  69
3  100  80   72  91

In [24]:
examDF

      국어  미술   수학  음악
이름
마징가   98  70   98  80
배트맨   79  99   70  93
홍길동   99  87  100  69
임꺽정  100  80   72  91